study/sato/design/app/views/posts/show.html.erb

<ul>
<% if @post.comments.any? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 2